arr = {1,2,9,16,17,25,28,29,35,36,37,38,44,45,47,48,49,51,53,54,58,59,61,63,76};
Exp = { 50, 150, 300, 500, 750, 1050, 1400, 1800, 2250, 2750, 3850, 5050, 6350, 7750, 9250, 10850, 12550, 14350, 16750, 18250, 21400, 24700, 28150, 31750, 35500, 39400, 43450, 47650, 52000, 60000, 68250, 76750, 85500, 94500, 105000, 117000, 130000, 145000, 163000, 183000, 205000,	230000,	258000,	288000,	320000,	355000,	393000,	433000,	478000,	528000 };
txt = {};
txt[1] = {1,"胡大哥，咱们来练习一下武术。","大哥，承让了。","兄弟还需多加练习。"};--胡斐
txt[2] = {2,"灵姑娘，咱们来练习一下用毒解毒的方法。","灵姑娘伤到了没？","公子还需多加学习抗毒的方法。"};--程灵素
txt[3] = {9,"张兄，咱们来练习一下武功。","张兄的九阳神功没有使足。","公子多练练九阴真经吧。"};--张无忌
txt[4] = {16,"胡先生，我来讨教一下医术。","胡先生医人为主。","少侠故意让着我呢。"};--胡青牛
txt[5] = {17,"王前辈，我来讨教一下用毒方法。","王前辈用毒为主。","少侠喜欢就好。"};--王难姑
txt[6] = {25,"蓝姑娘，咱们来练练武功。","蓝姑娘认真看招啊。","负心汉不负心。"};--蓝凤凰
txt[7] = {28,"平大夫，我来讨教一下医术。","平大夫精通的主要是医术。",""};--平一指
txt[8] = {29,"田兄，咱们来切磋一下技术。","田兄最近忙于业务。","兄弟要保养好身体啊。"};--田伯光
txt[9] = {35,"令狐兄，咱们来切磋一下武艺。","令狐兄酒喝的有点多。","来来来，再干一杯。"};--令狐冲
txt[10] = {36,"林公子，咱们来切磋一下武艺。","林公子还需多加练习。","公子承让了。"};--林平之
txt[11] = {37,"狄兄，咱们来切磋一下武艺。","狄兄没有出全力。","公子在指点我武功呢。"};--狄云
txt[12] = {38,"石兄弟，咱们来切磋一下武艺。","石兄弟没使足劲。","好兄弟，伤着没？"};--石破天
txt[13] = {44,"徒弟，咱们来切磋一下武艺。","徒弟呀，大剪刀要磨一下了。","徒弟呀，大剪刀厉害吧。"};--岳老三
txt[14] = {45,"薛先生，我来学习一下医术。","薛先生主要是医人。","公子折煞薛某了。"};--薛慕华
txt[15] = {47,"阿紫姑娘，咱们来练习一下武术。","阿紫姑娘好手段。","愣小子看什么呢？走神了。"};--阿紫
txt[16] = {48,"铁面，咱们来练习一下武术。","铁面你是不是没出力？","阿紫姑娘说的对。"};--游坦之
txt[17] = {49,"小师父，咱们来练习一下武术。","小师父你把少林功夫忘光了，新武艺也没学精啊。","施主，可有受伤？"};--虚竹
txt[18] = {51,"慕容公子，咱们来练习一下武术。","慕容公子学的太杂了。","还是和我去复兴大燕吧。"};--慕容复
txt[19] = {53,"段公子，咱们来练习一下武术。","段公子，最近疏于练功了。","公子，咱们还是去旅行吧。"};--段誉
txt[20] = {54,"袁兄，咱们来练习一下武术。","袁兄太久没在江湖走动了。","小兄弟，承让了。"};--袁承志
txt[21] = {58,"杨兄，咱们来练习一下武术。","杨兄功夫精进的有些慢了。","兄弟，一臂不如一臂啊。"};--杨过
txt[22] = {59,"龙姑娘，咱们来练习一下武术。","龙姑娘最近面色红润了许多。","公子，承让了。"};--小龙女
txt[23] = {61,"欧阳公子，咱们来练习一下武术。","欧阳公子还是别去颠覆武林了。","快和我一起去颠覆武林吧。"};--欧阳克
txt[24] = {63,"程姑娘，咱们来练习一下武术。","程姑娘最拿手的是五行八卦。","公子，承让了。"};--程英
txt[25] = {76,"王姑娘，咱们来练习一下武术。","王姑娘的主要修为是武学理论。","公子，承让了。"};--王语嫣
for i = 1, #txt do
	battlenum = i + 254;--战斗编号（=触发器编号）
	talkid = txt[i][1];
	talktxt1 = txt[i][2];
	talktxt2 = txt[i][3];
	talktxt3 = txt[i][4];
	if (talkid == 76) then
	talkid = talkid + 33;--王语嫣修正
	end;
	if (GetCurrentEventID() == battlenum) then
		Talk(0, talktxt1);
		Talk(talkid, "好。");
		if TryBattle(battlenum) == false then goto label0 end;
		LightScence();
		RestTeam();
		Talk(0, talktxt2);
		do return end;
		::label0::
		LightScence();
		RestTeam();
		Talk(talkid, talktxt3);
		do return end;
	end;
end;
do return end;