Talk(0, "请问这位师父，这里就是<color=Red>少林寺</color>吗？", "", 1);
Talk(96, "正是。", "", 0);
Talk(0, "<color=Red>少林寺</color>耶！武学的殿堂，武侠小说中绝对少不了的场景，赶紧进去看一看。", "", 1);
Talk(96, "方丈率寺中弟子，与其余五大派共同围攻<color=Red>光明顶</color>去了，至今未回。请施主下山。", "", 0);
ModifyEvent(-2, 3, -2, -2, 521, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu启动脚本521，场景28-3
ModifyEvent(-2, 4, -2, -2, 521, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu启动脚本521，场景28-4
ModifyEvent(-2, 5, -2, -2, 521, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu启动脚本521，场景28-5
ModifyEvent(-2, 6, -2, -2, 521, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu启动脚本521，场景28-6
do return end;
