Talkplus(4138);--0,"看你的样子不像野狼，肯定以前是有人养的。我就叫你小白好不好啊？"
PlayWave(103);--狗哈哈
jyx2_Wait(0.5);
Talkplus(4139);--0,"看来你同意了，那你以后就帮我看家吧。好不好？"
PlayWave(103);
jyx2_Wait(0.5);
Talkplus(4140);--0,"小白，也不知道以前你是和谁在一起？不过没关系，从今以后你就和我在一起！我给你讲个故事好不好呀？"
PlayWave(103);
jyx2_Wait(0.5);
Talkplus(4141);--0,"从前呀，有个小孩很淘气，经常一个人去深山里玩。有一次，他遇到了一头掉入陷阱的大灰狼。他和狼说：大灰狼，你别咬我，我就放了你，好不好？大灰狼轻叫了一声，好像听懂了。小孩费了好大力气才把陷阱解开。狼的脚受伤了，走不快，小孩说，你每天在这附近待着，我来给你送吃的，好不好？狼又轻叫了一声。"
PlayWave(103);
jyx2_Wait(0.5);
Talkplus(4142);--0,"从此以后小孩就经常去山里。小孩的父亲发现小孩总是去山里，就叮嘱说山里有狼，不安全。小孩说，什么狼……狼，饿狗罢了。"
PlayWave(103);
jyx2_Wait(0.5);
ModifyEvent(-2, -2, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
ModifyEvent(-2, 16, 0, 0, -1, -1, 2092, -1, -1, -1, -2, -2, -2);
ModifyEvent(-2, 17, 0, 0, -1, -1, 2093, -1, -1, -1, -2, -2, -2);
do return end;