ModifyEvent(-2, -2, -1, -1, -1, -1, -1, 3500, 3500, 3500, -2, -2, -2);--by fanyu|箱子变空。场景05-编号09
Talk(0, "这里有本书，书名是——《<color=#A564DB>雪山飞狐</color>》……原来《<color=#A564DB>雪山飞狐</color>》藏在这，胡大哥的军刀果然有用。咦！这边有张字条，写些什么来着……自受到金先生恩惠以来，即无时无刻不想着今生该如何报答……", "", 1);
Talk(0, "……日前自恶人手中夺回《<color=#A564DB>雪山飞狐</color>》一书，其余十三本则还流落在外，吾发誓有生之年定要竭尽所能将书找齐，送回<color=Red>圣堂</color>……", "", 1);
Talk(0, "……今日看见此书书名，觉得非常有意思，内人分娩日子将近，如果生下男孩，就叫他<color=Yellow>胡斐</color>吧。哈！“飞狐”，“<color=Yellow>胡斐</color>”。哈！哈！哈！有意思……胡一刀留。原来还有这段典故。", "", 1);
AddItem(145, 1);
do return end;
