arr = {0,1,2,9,16,17,25,28,29,35,37,38,44,45,47,48,49,51,53,54,58,59,61,63,76};
Exp = { 50, 150, 300, 500, 750, 1050, 1400, 1800, 2250, 2750, 3850, 5050, 6350, 7750, 9250, 10850, 12550, 14350, 16750, 18250, 21400, 24700, 28150, 31750, 35500, 39400, 43450, 47650, 52000, 60000, 68250, 76750, 85500, 94500, 105000, 117000, 130000, 145000, 163000, 183000, 205000,	230000,	258000,	288000,	320000,	355000,	393000,	433000,	478000,	528000 };
txt = {};
txt[1] = {0,"公子，咱们来练习一下武术。","公子，承让了。","林公子还需多加练习。"};--主角
txt[2] = {1,"胡公子，咱们来比拼一下刀剑。","胡公子还需多加练习。","林公子承让了。"};--胡斐
txt[3] = {2,"灵姑娘，咱们来练习一下用毒解毒的方法。","灵姑娘用毒巧妙。","林公子还需多加学习抗毒的方法。"};--程灵素
txt[4] = {9,"张公子，咱们来练习一下武功。","张公子的功夫不赖。","林公子还需多多练习。"};--张无忌
txt[5] = {16,"胡先生，我来讨教一下医术。","胡先生医人为主。","林少侠故意让着我呢。"};--胡青牛
txt[6] = {17,"王前辈，我来讨教一下用毒方法。","王前辈用毒为主。","林少侠还需多学习抗毒的方法。"};--王难姑
txt[7] = {25,"蓝教主，咱们来比试一下身手。","蓝教主鞭法绝妙。","林兄弟功夫不赖。"};--蓝凤凰
txt[8] = {28,"平大夫，我来讨教一下医术。","平大夫精通的主要是医术。",""};--平一指
txt[9] = {29,"田兄，咱们来比拼一下刀剑。","田兄最近忙于搬酒。","林兄弟要勤练剑法啊。"};--田伯光
txt[10] = {35,"大师兄，咱们来比试一下武艺。","大师兄故意让着我呢。","林师弟还需多多练习。"};--令狐冲
txt[11] = {37,"狄兄弟，咱们来切磋一下。","狄兄弟没有出全力。","林大哥在指点我武功呢。"};--狄云
txt[12] = {38,"石兄弟，咱们来切磋一下。","石兄弟没使足劲。","林大哥，伤着没？"};--石破天
txt[13] = {44,"南海鳄神，咱们来切磋一下武艺。","南海鳄神，你的大剪刀要磨一下了。","记住了，我大剪刀叫岳老二。"};--岳老三
txt[14] = {45,"薛先生，我来学习一下医术。","薛先生主要是医人。","林公子折煞薛某了。"};--薛慕华
txt[15] = {47,"阿紫姑娘，咱们来练习一下武术。","阿紫姑娘好手段。","林公子看走神了。"};--阿紫
txt[16] = {48,"游兄，咱们来练习一下武术。","游兄你是不是没出力？","不要欺负阿紫姑娘，要练功来找我。"};--游坦之
txt[17] = {49,"小师父，咱们来练习一下武术。","小师父你这是什么功夫？","施主，可有受伤？"};--虚竹
txt[18] = {51,"慕容公子，咱们来练习一下武术。","慕容公子学的太杂了。","林兄弟和我去复兴大燕吧。"};--慕容复
txt[19] = {53,"段公子，咱们来练习一下武术。","段公子，最近疏于练功了。","林公子，你还是和我一起去旅行吧。"};--段誉
txt[20] = {54,"袁兄，咱们来练习一下武术。","袁兄太久没在江湖走动了。","林兄弟，承让了。"};--袁承志
txt[21] = {58,"杨兄，咱们来练习一下武术。","杨兄最近在研究什么新功夫？","林兄弟，一臂不如一臂啊。"};--杨过
txt[22] = {59,"龙姑娘，咱们来练习一下武术。","龙姑娘功夫高深莫测。","林公子，承让了。"};--小龙女
txt[23] = {61,"欧阳公子，咱们来练习一下武术。","欧阳公子还是别去颠覆武林了。","快和我一起去颠覆武林吧。"};--欧阳克
txt[24] = {63,"程姑娘，咱们来练习一下武术。","程姑娘吹的箫真是好听。","林公子，承让了。"};--程英
txt[25] = {76,"王姑娘，咱们来练习一下武术。","王姑娘的主要修为是武学理论。","林公子，承让了。"};--王语嫣
for i = 1, #txt do
	battlenum = i + 304;--战斗编号（=触发器编号）
	talkid = txt[i][1];
	talktxt1 = txt[i][2];
	talktxt2 = txt[i][3];
	talktxt3 = txt[i][4];
	if (talkid == 76) then
	talkid = talkid + 33;--王语嫣修正
	end;
	if (GetCurrentEventID() == battlenum) then
		Talk(36, talktxt1);
		Talk(talkid, "好。");
		if TryBattle(battlenum) == false then goto label0 end;
		LightScence();
		RestTeam();
		Talk(36, talktxt2);
		do return end;
		::label0::
		LightScence();
		RestTeam();
		Talk(talkid, talktxt3);
		do return end;
	end;
end;
do return end;