Talkplus(1312);--36, "怎么样，救出我爹了吗？"
Talkplus(1313);--0, "迟了一步！我赶到了青城派之时，令……令尊已惨遭毒手。"
Talkplus(1314);--36, "什么！！！他们杀……杀了我父亲。"
Talkplus(1315);--0, "是的。"
Talkplus(1316);--36, "余沧海！！！此仇不报，我林平之禽兽不如！"
Talkplus(1317);--0, "林兄请节哀。"
Talkplus(1318);--36, "我林家到底与他有何冤仇？"
Talkplus(1319);--0, "江湖上传言，似乎是为了一本叫“辟邪剑谱”的秘笈。"
Talkplus(1320);--36, "可是我家实在没什么辟邪剑谱。这七十二路辟邪剑法，是我爹爹亲口传授，哪有什么剑谱。"
Talkplus(1321);--0, "江湖中人谣传此剑法威力无穷，所以引得余沧海这老贼的觊觎。"
Talkplus(1322);--36, "若是我林家的辟邪剑法当真威力无穷，今天我林家也不会落得如此下场。"
Talkplus(1323);--0, "可是你先祖不是打败过长青子吗？"
Talkplus(1324);--36, "是了，或许是我和父亲尚未完全融会贯通，从今以后，我要好好钻研此剑法，为我双亲报仇。多谢少侠帮忙，这份恩情，我林平之他日定当回报。"
if not HaveItem(185) then goto label1 end;
if ShowYesOrNoSelectPanel("是否将林震南遗言交给林平之？") == true then goto label0 end;
::label1::
	ModifyEvent(-2, 2, -2, -2, -1, -1, 312, -2, -2, -2, -2, -2, -2);
	ModifyEvent(-2, -2, -2, -2, 314, -1, -1, -2, -2, -2, -2, -2, -2);
	ModifyEvent(36, 0, -2, -2, 315, -1, -1, -2, -2, -2, -2, -2, -2);
	ModifyEvent(36, 1, -2, -2, 315, -1, -1, -2, -2, -2, -2, -2, -2);
	ModifyEvent(36, 2, -2, -2, 315, -1, -1, -2, -2, -2, -2, -2, -2);
	ModifyEvent(36, 3, -2, -2, 315, -1, -1, -2, -2, -2, -2, -2, -2);
	AddEthics(-4);
    do return end;
::label0::
Talkplus(1325);--0, "对了，你父亲临死之前，曾留下一些遗言。他说：“福州向阳巷老宅地窖中的物事，是林家祖传之物，须得好好保管。但曾祖远图公留有遗训，林家子孙，不得翻看，否则后患无穷。”"
AddItem(185,-1);
ModifyEvent(-2, 2, -2, -2, -1, -1, 313, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, -2, -2, -2, 314, -1, -1, -2, -2, -2, -2, -2, -2);
NPCAddItem(36, 78, 1);
SetOneMagic(36, 0, 60, 100);
SetSexual(36, 2);
AddEthics(2);
do return end;