ModifyEvent(-2, 0, -2, -2, -1, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 1, -2, -2, -1, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 3, -2, -2, -1, -1, 62, -2, -2, -2, -2, -2, -2);
Talk(13, "你是谁？到这<color=Red>冰火岛</color>上做什么？", "", 0);
Talk(0, "想不到这冰天雪地的荒岛上竟还有人居住。前辈身体想必甚为健朗。", "", 1);
Talk(13, "听你的声音，还只是个年轻小子，你们还有多少帮手，一起出来吧。", "", 0);
Talk(0, "听我的声音？莫非前辈视力不是很好。", "", 1);
Talk(13, "别以为我<color=Yellow>谢逊</color>眼睛瞎了就好对付，你们这些想夺屠龙宝刀的贼子，动手吧！", "", 0);
ModifyEvent(-2, 2, -2, -2, 74, 61, -2, -2, -2, -2, -2, -2, -2);
Talk(0, "你我无冤无仇，我们干嘛动手。", "", 1);
SetFlag("ShowLocationName.冰火岛",1);--大地图显示当前地图名
do return end;
