Talkplus(1299);--36, "怎么样，救出我爹了吗？"
Talkplus(1300);--0, "迟了一步！我赶到了青城派之时，令……令尊已惨遭毒手。"
Talkplus(1301);--36, "什么！！！他们杀……杀了我父亲。"
Talkplus(1302);--0, "是的。"
Talkplus(1303);--36, "余沧海！！！此仇不报，我林平之禽兽不如！"
Talkplus(1304);--0, "林兄请节哀。"
Talkplus(1305);--36, "我林家到底与他有何冤仇？"
Talkplus(1306);--0, "江湖上传言，似乎是为了一本叫“辟邪剑谱”的秘笈。"
Talkplus(1307);--36, "可是我家实在没什么辟邪剑谱。这七十二路辟邪剑法，是我爹爹亲口传授，哪有什么剑谱。"
Talkplus(1308);--0, "江湖中人谣传此剑法威力无穷，所以引得余沧海这老贼的觊觎。"
Talkplus(1309);--36, "若是我林家的辟邪剑法当真威力无穷，今天我林家也不会落得如此下场。"
Talkplus(1310);--0, "可是你先祖不是打败过长青子吗？"
Talkplus(1311);--36, "是了，或许是我和父亲尚未完全融会贯通，从今以后，我要好好钻研此剑法，为我双亲报仇。多谢少侠帮忙，这份恩情，我林平之他日定当回报。"
ModifyEvent(-2, 2, -2, -2, -1, -1, 312, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, -2, -2, -2, 314, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(36, 0, -2, -2, 315, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(36, 1, -2, -2, 315, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(36, 2, -2, -2, 315, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(36, 3, -2, -2, 315, -1, -1, -2, -2, -2, -2, -2, -2);
AddEthics(2);
do return end;