Talkplus(3204);--85, "小六子，你知不知道附近有什么好玩的。"
Talkplus(3205);--85, "三师兄，这次咱们来到这江南，少不得要上那杭州西湖玩一玩。古人不是说，上有天堂，下有苏杭吗？更何况江南的美女是出了名的。"
Talkplus(3206);--85, "你要上西湖玩，我问你对那边了解多少。你知道那里有什么武林同道吗？"
Talkplus(3207);--85, "小六子见闻浅薄，还请师兄开导。"
Talkplus(3208);--85, "我告诉你，苏杭一带最有名的便是姑苏慕容家了。江湖上人谈的“南慕容，北乔峰”，其中北乔峰指的是丐帮帮主，而南慕容指的就是姑苏慕容家的慕容复了。你们应该听说过姑苏慕容家的绝技吧。"
Talkplus(3209);--85, "“以彼之道，还施彼身”！"
Talkplus(3210);--85, "没错。听说姑苏慕容家藏书丰富，熟知天下武功，最擅长的就是以对方最厉害的功夫去杀害对方，令对手到死之前还不能相信这个事实。"
Talkplus(3211);--85, "那我们还是别乱玩好了，否则被他来个“泰山十八盘”剑法就糗大了。"
LearnMagic2(51,45,0);--慕容复学会泰山十八盘
do return end;