Talkplus(1542);--0, "这位小哥，你怎么了？"
Talkplus(1543);--38, "我……我……只记得自己坐在岩石上练功，突然间全身半边冰冷，半边火热……"
Talkplus(1544);--0, "莫非兄弟被蚊子叮到了？"
Talkplus(1545);--38, "老伯伯呢？他说要教我练捉麻雀的本事，却没跟我说练完会忽冷忽热，难过死了。"
Talkplus(1546);--0, "捉麻雀的本事？"
Talkplus(1547);--38, "是啊！老伯伯先是教我练泥人上的功夫，练到后来，常会全身发冷，可是老伯伯说这是练功应有之象。后来老伯伯又教我其它的练法，可是又更难过了，有时全身发冷，有时奇热难忍，练这捉麻雀的本事真辛苦！"
Talkplus(1548);--0, "原来兄台练功时走火入魔！"
Talkplus(1549);--38, "啊！又来了……我……我不，不跟你说了。"
ModifyEvent(-2, -2, -2, -2, 334, 335, -2, -2, -2, -2, -2, -2, -2);
if jyx2_CheckEventCount(38,333,0) == 0 then Add3EventNum(38,333,Calendar(2),0,0) end;--初识石破天计数器
SetFlag("ShowLocationName.摩天崖",1);--大地图显示当前地图名
do return end;