Talkplus(1165);--0, "看您老一脸英气凛然，王者之尊的样子，想必是梅庄的大庄主。"
Talkplus(1166);--34, "不敢当，正是老夫。不知少侠到我梅庄来有何贵事？"
Talkplus(1167);--0, "我听江湖上传言贵庄内卧虎藏龙，高手如云，一时心生好奇，特来探个究竟。"
Talkplus(1168);--34, "我梅庄四友隐居江南已久，对江湖之事早已淡如轻烟，什么卧虎藏龙，高手如云，不过是武林中人随口胡诌罢了。"
Talkplus(1169);--0, "我看也是如此，其它那三位庄主简直是“鲁肉脚”，三两下就被我解决了。"
Talkplus(1170);--31, "小子你！……"
Talkplus(1171);--34, "这个我已听我那三个兄弟说过，不过对于外在的声名利禄我们早已抛诸脑后，也不会在乎武林上对我们的评论！"
Talkplus(1172);--0, "＜这老家伙真沉得住气，要激他动手可不简单，可得好好想个办法。＞"
Talkplus(1173);--34, "少侠请慢走，老夫不送了。"
ModifyEvent(-2, -2, -2, -2, 260, 264, -2, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 16, -2, -2, 261, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 17, -2, -2, 262, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 18, -2, -2, 263, -1, -1, -2, -2, -2, -2, -2, -2);
do return end;