Talkplus(1716);--0, "这位兄台，不知洞中那头大雕是你驯养……咦！你的手臂？莫非是那头大雕所……唉！我刚还救了它，早知就该让它被巨蟒咬死算了。"
Talkplus(1717);--58, "巨蟒？你说你救了雕兄，杨过在此谢过。"
Talkplus(1718);--0, "你的伤不是那雕所为？"
Talkplus(1719);--58, "不是。"
Talkplus(1720);--0, "但你看起来像是最近才受伤的，不知杨兄有何困难，是否要在下相助？"
Talkplus(1721);--58, "这伤？唉！不提也罢？"
Talkplus(1722);--0, "莫非是女人所为？"
Talkplus(1723);--58, "阁下怎会知道？"
Talkplus(1724);--0, "我是随便猜猜的，因为自古以来，只有贱女人才会变态到砍人手臂。"
Talkplus(1725);--58, "唉！我们不谈这些了。不知少侠为何会到此地？"
Talkplus(1726);--0, "老实说我是在找一些东西，找东西当然是要往隐密的地方去找。找着找着就到了这山谷。一进洞后，便看到大雕与巨蟒正在缠斗。那只大雕是杨兄饲养的吗？"
Talkplus(1727);--58, "不是的。其实我也是无意中来到这山谷，才发现雕兄的。后来相处了一段时间，我们就成了好朋友。据我在洞中所见，这雕应是一位名为独孤求败的前辈所养的。"
Talkplus(1728);--0, "独孤求败？"
Talkplus(1729);--58, "是的，这位前辈号称自己为“剑魔独孤求败”。在他遗留下的字迹中这样子写到：“纵横江湖三十余载，杀尽仇寇，败尽英雄，天下更无抗手，无可奈何，惟隐居深谷，以雕为友。呜呼，生平求一敌手而不可得，诚寂寥难堪也。”这位前辈只因世上无敌，只得在深山隐居，其武功之深湛，真不知到了何等地步。"
Talkplus(1730);--58, "此人号称“剑魔”，自是运剑若神，名字叫“求败”，想是走遍天下欲寻一胜己之人，始终未能如愿，终于在此处郁郁以殁。每每缅怀到此前辈的风采，就不禁……咳，咳……不禁令人向往……咳，咳……一兴起话就说太多了。"
Talkplus(1731);--0, "杨兄身上似乎有伤？"
Talkplus(1732);--58, "不瞒少侠，杨某身中“情花”之毒，恐怕活不了多久了。"
Talkplus(1733);--0, "杨兄这什么话，兄弟我帮你去找个名医来看看，天下哪有治不好的病。"
Talkplus(1734);--58, "不劳少侠费心了，这情花乃是绝情谷独有之物，而其毒性也只有“绝情丹”能解。"
Talkplus(1735);--0, "那我替兄台去一趟绝情谷，找这绝情丹好了。"
Talkplus(1736);--58, "现在绝情谷想必已空无一人了，最后的一颗绝情丹也被我丢下绝情谷底……如此如此……这般这般……龙儿随南海神尼而去，也不知过得如何……啊！……我……我好想她……"
Talkplus(1737);--0, "原来事情的经过是这样，我看还是请杨兄先暂时扼抑情欲，以免牵动情花之毒。我还是到处去寻访名医，看看有没有别的方法医治这情花之毒。否则十六年后，龙姑娘病愈归来，却见不着杨兄了。"
Talkplus(1738);--58, "要不是杨某身染重毒，否则就随少侠一走。"
Talkplus(1739);--0, "看来我得先上绝情谷走一趟，看这“情花”到底长得什么模样。或许在谷中有收获也说不定呢。常听人说毒蛇出没之处，七步之内必有解毒之药。"
Talkplus(1740);--58, "那少侠可得小心，别被那情花刺到，否则……"
Talkplus(1741);--0, "否则这世上就多了个跟杨兄“同病相怜”的人。我这就去了，请杨兄保重。"
Talkplus(1742);--58, "对了，那绝情谷地处偏僻，你必须乘船顺着黄河而上，才到得了。"
if (difficulty == 2) then
	OpenScene(22);--开放绝情谷
end;
ModifyEvent(-2, -2, -2, -2, 395, 396, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 7, -2, -2, -1, -1, 398, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 8, -2, -2, -1, -1, 398, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 9, -2, -2, -1, -1, 398, -2, -2, -2, -2, -2, -2);
ChangeMMapMusic(3);
if jyx2_CheckEventCount(58,333,0) == 0 then Add3EventNum(58,333,Calendar(2),0,0) end;--初识杨过计数器
do return end;