Talkplus(3227);--0, "林师父，有件事能不能请你帮个忙。"
Talkplus(3228);--75, "什么事？"
Talkplus(3229);--0, "有道菜不知你听过没，能不能帮我做一下。"
Talkplus(3230);--75, "哪道菜？"
Talkplus(3231);--0, "“玉笛谁家听落梅”。"
Talkplus(3232);--75, "“玉笛谁家听落梅”，这不是桃花岛的招牌菜吗。嗯，做这道菜是有点麻烦，不过还难不倒我。"
Talkplus(3233);--0, "真的！"
Talkplus(3234);--75, "不过，这菜需要的材料蛮多的，我这边现在也没有。"
Talkplus(3235);--0, "什么材料，我帮你找去。"
Talkplus(3236);--75, "好，仔细听着：第一样材料是羊羔坐臀，第二样材料是小猪耳朵，第三样材料是小牛腰子，第四样材料是獐腿肉，"
Talkplus(3237);--75, "最后一样材料是兔肉，总共五种材料。你如果找齐这五种材料后，我就可以帮你做出“玉笛谁家听落梅”这道菜了。"
ModifyEvent(-2, -2, -2, -2, 676, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本676 场景32-编号0
do return end;