Talk(0, "想不到在这没什么人烟的地方，你们客栈生意还这么的好？", "", 1);
Talk(106, "那可不。要知方圆百里之内，只有我们这间客栈。你若不想冻死在这东北雪地里，就必须在本店里歇上一歇再走。怎么，这位公子不远千里来到这东北雪地中，是为了向“<color=Yellow>北丑</color>”寻求解惑呢？还是去找那“狐狸”要书的呢？", "", 0);
Talk(0, "<color=Yellow>北丑</color>？狐狸？", "", 1);
Talk(106, "是啊！会来我们这的，要不是想跟<color=Yellow>北丑</color>那疯子要些线索，打听一些武林中的秘密。要不就是找那外号“雪山飞狐”的<color=Yellow>胡斐</color>打架，夺取“十四天书”。江湖中人都盛传着，《<color=#A564DB>雪山飞狐</color>》一书肯定在他那，否则他怎么以此做为外号。", "", 0);
Talk(0, "小二哥，你知道的还真多。", "", 1);
Talk(106, "那当然，要不然怎么会叫做小二哥呢？好，今天小二哥高兴，多告诉你一些。那<color=Yellow>北丑</color>住的地方，是在本店的西北方，而<color=Yellow>胡斐</color>则是住在东北方。不过你得小心点，最近有很多居民在山中无缘无故走失了，传说是雪怪出来作乱。", "", 0);
Talk(0, "谢谢你的忠告。", "", 1);
do return end;
