if UseItem(130) == true then goto label0 end;
do return end;
::label0::
AddEthics(2);
AddItemWithoutHint(130, -1);
Talkplus(2305);--0, "慕容公子，你要找的大燕国传国玉玺在这里。"
Talkplus(2306);--51, "真的找到了！有了它，我大燕复国有望。"
Talkplus(2307);--0, "那慕容公子可否履行诺言，告知在下《天龙八部》一书的下落。"
Talkplus(2308);--51, "等会，有了传国玉玺并不能证明我慕容复的身份，那么别人就不会听我号召……大燕皇帝世系谱表呢？大燕皇帝世系谱表呢？"
Talkplus(2309);--0, "慕容公子并未叫我找那什么大燕皇帝世系谱表啊！"
Talkplus(2310);--51, "没有大燕皇帝世系谱表，别人怎会相信我慕容复是王孙的后代。你快去找大燕皇帝世系谱表，找到了我才跟你说《天龙八部》的下落。"
Talkplus(2311);--109, "表哥，做人怎可言而无信，你说好要告诉这位公子的，怎可反悔。你不说，我可要告诉他了。"
Talkplus(2312);--51, "你敢！"
Talkplus(2313);--109, "……"
Talkplus(2314);--0, "好，我就再信你一次，去帮你找那什么世系谱表。希望到时慕容公子别再失信。"
Talkplus(2315);--51, "好了，看你这么辛苦，我就先送你一本旷世棋谱，就在我房间箱子里，这是钥匙。"
ModifyEvent(-2, -2, -2, -2, 572, 573, -1, -2, -2, -2, -2, -2, -2);
AddItem(166, 1);
do return end;