txt = {};
txt[1] = {4648,4573,4574,4575};--主角
txt[2] = {4649,4576,4577,4578};--胡斐
txt[3] = {4650,4579,4580,4581};--程灵素
txt[4] = {4651,4582,4583,4584};--张无忌
txt[5] = {4652,4585,4586,4587};--胡青牛
txt[6] = {4653,4588,4589,4590};--王难姑
txt[7] = {4654,4591,4592,4593};--蓝凤凰
txt[8] = {4655,4594,4595,4596};--平一指
txt[9] = {4656,4597,4598,4599};--田伯光
txt[10] = {4657,4600,4601,4602};--令狐冲
txt[11] = {4658,4603,4604,4605};--狄云
txt[12] = {4659,4606,4607,4608};--石破天
txt[13] = {4660,4609,4610,4611};--岳老三
txt[14] = {4661,4612,4613,4614};--薛慕华
txt[15] = {4662,4615,4616,4617};--阿紫
txt[16] = {4663,4618,4619,4620};--游坦之
txt[17] = {4664,4621,4622,4623};--虚竹
txt[18] = {4665,4624,4625,4626};--慕容复
txt[19] = {4666,4627,4628,4629};--段誉
txt[20] = {4667,4630,4631,4632};--袁承志
txt[21] = {4668,4633,4634,4635};--杨过
txt[22] = {4669,4636,4637,4638};--小龙女
txt[23] = {4670,4639,4640,4641};--欧阳克
txt[24] = {4671,4642,4643,4644};--程英
txt[25] = {4672,4645,4646,4647};--王语嫣
for i = 1, #txt do
	battlenum = i + 304;--战斗编号（=触发器编号）
	talkid = txt[i][1];
	talktxt1 = txt[i][2];
	talktxt2 = txt[i][3];
	talktxt3 = txt[i][4];
	-- if (talkid == 76) then
	-- talkid = talkid + 33;--王语嫣修正
	-- end;
	if (GetCurrentEventID() == battlenum) then
		Talkplus(talktxt1);
		Talkplus(talkid);
		if TryBattle(battlenum) == false then goto label0 end;
		LightScence();
		RestTeam();
		Talkplus(talktxt2);
		do return end;
		::label0::
		LightScence();
		RestTeam();
		Talkplus(talktxt3);
		do return end;
	end;
end;
do return end;