Talk(66, "小子，事情办好了吗？", "", 0);
Talk(0, "晚辈已见过了段皇爷。", "", 1);
Talk(66, "你杀了他了？", "", 0);
Talk(0, "没有。", "", 1);
Talk(66, "哼！连这事都办不好，我原本还指望你上<color=Red>桃花岛</color>帮我救<color=Yellow>周伯通</color>呢。", "", 0);
Talk(0, "救<color=Yellow>周伯通</color>？他早己不在<color=Red>桃花岛</color>了，听说他逃了出来。", "", 1);
Talk(66, "真的？", "", 0);
Talk(0, "晚辈觉得前辈还是不要报这个仇，何况你儿子也不是段皇爷所杀的。", "", 1);
Talk(66, "虽非他所杀，但也是被他害死的。", "", 0);
Talk(0, "段皇爷不肯救你儿子，也是因为爱你啊。", "", 1);
Talk(66, "哼，爱我？", "", 0);
Talk(0, "他是喝周前辈的醋。若是不爱你，他为什么要喝醋？他见到你那块“四张机”的鸳鸯锦帕，实是伤心至极。依我看这件事还是算了吧。", "", 1);
Talk(66, "……那好，只要你把<color=Yellow>周伯通</color>找来见我，我就告诉你《<color=#A564DB>射雕英雄传</color>》一书的下落。", "", 0);
Talk(0, "这个简单，只要不叫我去杀好人都可以。", "", 1);
ModifyEvent(-2, -2, -2, -2, 421, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动421脚本。场景21-编号01
ModifyEvent(20, 4, -2, -2, 411, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动411脚本。场景20-编号04
ModifyEvent(47, 0, -2, -2, 428, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动428脚本。场景47-编号00
ChangeMMapMusic(3);
do return end;
