Talkplus(543);--15,"小子，你怎么老是跑来灵蛇岛，存心扰我老人家清静是不？"
Talkplus(544);--0,"只怕您不是普通的老太婆，而是明教的四大护法之首，紫衫龙王。"
Talkplus(545);--15,"你这小子倒也厉害，居然知道我老太婆的真实身份。你说，这次来是做什么？"
Talkplus(546);--0,"晚辈是替明教捎个口信，希望龙王能回光明顶去。"
Talkplus(547);--15,"要我回去做什么，看他们在那里争吵谁要当教主吗？老太婆我倒宁愿留在这清静清静。"
Talkplus(548);--0,"龙王，你还有所不知，阳教主生前留下一封遗书，要谢护法暂代副教主之位。事情的经过是这样的……"
Talkplus(549);--15,"那更好了，有谢三哥在，教中的一切事务，我就放心了。而我，就更可以在这休养了。"
Talkplus(550);--0,"＜看来得激她一下 ＞我说明教这“光明圣火阵”有多厉害嘛？我倒也不信。明教被六大派围攻，还不是靠我去帮他们解围。我看是谢护法不想给我这《倚天屠龙记》一书，才故意编了这么一个难题。"
Talkplus(551);--15,"你说什么？你是说我明教都没人了，一切都要靠你这娃儿帮忙？"
Talkplus(552);--0,"我是没这么说，但事实是如此。"
Talkplus(553);--15,"小娃儿，不要以为运气好打赢了几场，就神气起来了。要知一山还有一山高，我明教这“光明圣火阵”从创教至今，还没人能破过。"
Talkplus(554);--0,"我就不信有什么是破不了的。"
Talkplus(555);--15,"好大的口气，我就让你知道“光明圣火阵”的厉害，有种就上我光明顶来。"
ModifyEvent(11, 90, 1, 1, 111, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(11, 91, 1, 1, 112, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(11, 92, 1, 1, 113, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(11, 93, 1, 1, 114, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(11, 94, 1, 1, 115, -1, -1, -2, -2, -2, -2, -2, -2);
DarkScence();
ModifyEvent(11, 101, 1, 1, 116, -1, -1, 5288, 5288, 5288, -2, -2, -2);
jyx2_ReplaceSceneObject("11", "NPC/金花婆婆101", "1");--紫衫龙王
ModifyEvent(-2, -2, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2);
jyx2_ReplaceSceneObject("", "NPC/金花婆婆", "");--紫衫龙王
LightScence();
ChangeMMapMusic(3);
ModifyEvent(-2, 4, -2, -2, 2025, -1, -1, -2, -2, -2, -2, -2, -2);--by citydream启动脚本-2025改变对话。本场景12-4
ModifyEvent(-2, 5, -2, -2, 2025, -1, -1, -2, -2, -2, -2, -2, -2);--by citydream启动脚本-2025改变对话。本场景12-5
SetFlag("ShowLocationName.灵蛇岛",1);--大地图显示当前地图名
do return end;