Talk(85, "小六子，你知不知道附近有什么好玩的。", "", 0);
Talk(85, "三师兄，这次咱们来到这江南，少不得要上那杭州西湖玩一玩。古人不是说，上有天堂，下有苏杭吗？更何况江南的美女是出了名的。", "", 4);
Talk(85, "你要上西湖玩，我问你对那边了解多少。你知道那里有什么武林同道吗？", "", 0);
Talk(85, "小六子见闻浅薄，还请师兄开导。", "", 4);
Talk(85, "我告诉你，苏杭一带最有名的便是姑苏慕容家了。江湖上人谈的“南慕容，北乔峰”，其中北乔峰指的是<color=Red>丐帮</color>帮主，而南慕容指的就是姑苏慕容家的<color=Yellow>慕容复</color>了。你们应该听说过姑苏慕容家的绝技吧。", "", 0);
Talk(85, "“以彼之道，还施彼身”！", "", 4);
Talk(85, "没错。听说姑苏慕容家藏书丰富，熟知天下武功，最擅长的就是以对方最厉害的功夫去杀害对方，令对手到死之前还不能相信这个事实。", "", 0);
Talk(85, "那我们还是别乱玩好了，否则被他来个“<color=orange>泰山十八盘</color>”剑法就糗大了。", "", 4);
do return end;
