Talkplus(1198);--33, "少侠，好久不见，近来可好？"
Talkplus(1199);--0, "＜这么客气，一定有诈，还是小心得好。＞托你的福，一切还好。"
Talkplus(1200);--33, "不知少侠对那先前的比武之约定还否算数？"
Talkplus(1201);--0, "＜原来是在“哮想”我那四样东西。＞当然算数，我说过只要贵庄中有人能够打得赢我，我那四件书画，一定双手奉上。"
Talkplus(1202);--33, "够爽快！小兄弟。敝庄实另有一位朋友，听说少侠的武功如此了得，说什么也要和你较量几手。"
Talkplus(1203);--0, "这样啊，好！没问题，就请二庄主替我引见引见。"
Talkplus(1204);--33, "那位朋友一向不习惯阳光下的生活，所以将自己关在梅庄下的地洞中。"
Talkplus(1205);--0, "＜天底下还有这种人，喜欢把自己关在地洞里，真是怪异。＞"
Talkplus(1206);--33, "这是钥匙，少侠你自个儿先行进去，我找其他的三位兄弟，叫大伙一起去做公证。对了，地洞的入口在一间摆有四张椅子及一张桌子的房间内。"
Talkplus(1207);--0, "干嘛，你们四人闲起来就打麻将啊？"
Talkplus(1208);--33, "咦！你怎么会知道？这是我兄弟四人正在研究的游戏。目前只有一个雏形而已，甚至连特殊牌都还没有决定好用哪四种名称？"
Talkplus(1209);--0, "＜难不成这麻将就是这四人无聊时发明出来的？＞你们想用什么名称？"
Talkplus(1210);--33, "就用我们四人的兴趣，“琴棋书画”四字。"
Talkplus(1211);--0, "不好，用“春夏秋冬”或是“梅兰竹菊”比较好。较能表现出四季的变化。"
Talkplus(1212);--33, "是吗？听起来似乎不错。"
Talkplus(1213);--0, "我这就去找他。"
ModifyEvent(-2, -2, -2, -2, 281, -1, -1, -2, -2, -2, -2, -2, -2);
SetScenceMap(-2, 1, 28, 30, 1832);
SetScenceMap(-2, 1, 29, 30, 0);
SetScenceMap(-2, 1, 30, 30, 1836);
jyx2_FixMapObject("梅庄里门打开",1);
AddItem(161, 1);
do return end;