Talk(79, "我说老五啊，天气这么冷，喝这烈酒虽能驱寒，但如能再配上热腾腾的<color=#FD726F>兔肉</color>，那才真是够味呢。", "", 0);
Talk(79, "四哥，在这寒天雪地中，上哪找<color=#FD726F>兔肉</color>去？", "", 4);
Talk(79, "谁说没有兔子，只是我们功夫不济，抓不到罢了。我曾听人家说，在极北之地有一个很厉害的猎户，轻功极高，在这雪地上猎兔，犹如猎鹰般的快，狠，准。", "", 0);
Talk(79, "那还等什么，我们这就上他家去要点<color=#FD726F>兔肉</color>来吃。", "", 4);
Talk(79, "你想上他家？我看要等到下辈子了。你知道他住哪吗？他住的地方叫“<color=Red>云鹤崖</color>”，轻功不到家的人根本就上不去。", "", 0);
Talk(79, "<color=Red>云鹤崖</color>？他该不会是……", "", 4);
Talk(79, "没错，四大恶人之一的云中鹤。", "", 0);
Talk(79, "那……那我们还是喝酒就好了。", "", 4);
do return end;
