Talkplus(3242);--72, "年轻人，是来投靠我霹雳堂的吗？"
Talkplus(3243);--0, "霹雳堂？这里叫做霹雳堂。是演布袋戏的吗？"
Talkplus(3244);--72, "你胡说些什么！我霹雳堂在江湖上是何等的地位，你居然不知。那么轰动武林，惊动万教的霹雳堂堂主“孔八拉”，你总该知道了吧。"
Talkplus(3245);--0, "“孔八拉”！那不是流氓吗？你是坏人对不对。"
Talkplus(3246);--72, "胡说，我孔八拉怎么会是坏人，你不要乱说话，害我招不到弟子。"
Talkplus(3247);--0, "我才没胡说呢，否则全屋子里怎么只有你一个人，难道其它人都送去管训了吗？"
Talkplus(3248);--72, "那是我还没找到合适的人，去宣扬我霹雳堂的教义，否则我霹雳堂早就人满为患。"
Talkplus(3249);--0, "难怪日后我台湾岛上有这么多的“兄弟”，有人在打球，有人打“打球的人”。"
Talkplus(3250);--72, "你是在绕口令吗？嗯！听起来口才不错，很适合做我霹雳堂的宣扬大使。"
Talkplus(3251);--72, "这样吧，我将我霹雳堂最厉害的武器“霹雳弹”赠送给你，你把它拿到江湖上去大展神威，让道上的朋友知道我霹雳堂的厉害。"
Talkplus(3252);--0, "“霹雳弹”？"
Talkplus(3253);--72, "不错，这霹雳弹是我霹雳堂所研发出来的独门暗器，用“硝石”制成，威力无比。我这里有几颗，你拿去吧。"
Talkplus(3254);--72, "另外还有一本“霹雳秘笈”里面记载霹雳弹的制作方法及一般暗器的介绍，你也拿去吧。不过记着，必须要有硝石才能制造出霹雳弹。"
Talkplus(3255);--0, "好啊，快给我。有了这，武功不强也可打倒敌人了。"
Talkplus(3256);--72, "等一下。我想起了一件事，这东西不能给你。"
Talkplus(3257);--0, "为什么？"
Talkplus(3258);--72, "我差点忘记父亲的交待了，我父亲交待我要将这东西留给“金先生”的传人。因为这人刚开始时武功一定不好，要靠我霹雳堂的霹雳弹去帮助他。"
Talkplus(3259);--0, "你父亲认识Ｍｒ．金？"
Talkplus(3260);--72, "他的外号叫“密斯特”吗？这个我父亲倒没提过。不过据我父亲讲，他们的交情还不错。"
Talkplus(3261);--0, "那你知道“十四天书”的事吗？或是其他有关金先生的事？"
Talkplus(3262);--72, "我父亲没跟我讲多少，除了说有一位金先生的传人日后可能会来，要我帮助他……对了，你怎么会问这些？莫非……"
Talkplus(3263);--0, "没错，我就是那位传人。"
Talkplus(3264);--72, "真的吗！那太好了。如此我就可以将这两样东西送你。"
Talkplus(3265);--0, "谢谢孔堂主。"
Talkplus(3266);--72, "对了，屋内还有两样东西你也拿去吧。一样是一种可提神醒脑，恢复体力的东西，也是本岛的名产，叫做“槟榔”。"
Talkplus(3267);--0, "我的妈呀！"
Talkplus(3268);--72, "还有一样则是我以前常穿的“皮衣”，具有着防御的功能。但是最近实在太热了，我也用不着，就送你吧。"
Talkplus(3269);--0, "＜穿皮衣吃槟榔！还真是标准的“孔八拉”！＞"
Talkplus(3270);--72, "如果屋子内还有什么你需要的，尽管拿，别客气。日后，如果有什么困难，就回来找我，到时，就算我帮不上忙，我也会召集一票弟兄去帮你。不过，还得先靠你将我霹雳堂的名声发扬光大才是。"
Talkplus(3271);--0, "我会的。那在下告辞了。"
Talkplus(3272);--72, "慢走。"
SetFlag("ShowLocationName.霹雳堂",1);--大地图显示当前地图名
AddItem(101, 10);
AddItem(89, 1);
AddItem(163, 1);
ModifyEvent(-2, -2, -2, -2, 679, 686, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 7, -2, -2, 2038, -1, -1, -2, -2, -2, -2, -2, -2);--by citydream 启动脚本2038 场景76-编号7
do return end;