Talk(0, "林师父，有件事能不能请你帮个忙。", "", 1);
Talk(75, "什么事？", "", 0);
Talk(0, "有道菜不知你听过没，能不能帮我做一下。", "", 1);
Talk(75, "哪道菜？", "", 0);
Talk(0, "“<color=blue>玉笛谁家听落梅</color>”。", "", 1);
Talk(75, "“<color=blue>玉笛谁家听落梅</color>”，这不是<color=Red>桃花岛</color>的招牌菜吗。嗯，做这道菜是有点麻烦，不过还难不倒我。", "", 0);
Talk(0, "真的！", "", 1);
Talk(75, "不过，这菜需要的材料蛮多的，我这边现在也没有。", "", 0);
Talk(0, "什么材料，我帮你找去。", "", 1);
Talk(75, "好，仔细听着：第一样材料是<color=#FD726F>羊羔坐臀</color>，第二样材料是<color=#FD726F>小猪耳朵</color>，第三样材料是<color=#FD726F>小牛腰子</color>，第四样材料是<color=#FD726F>獐腿肉</color>", "", 0);
Talk(75, "最后一样材料是<color=#FD726F>兔肉</color>，总共五种材料。你如果找齐这五种材料后，我就可以帮你做出“<color=blue>玉笛谁家听落梅</color>”这道菜了。", "", 0);
ModifyEvent(-2, -2, -2, -2, 676, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu 启动脚本676 场景32-编号0
do return end;
