Talkplus(2609);--0, "老先生，怎么一个人坐在这下棋，这棋一个人下得起来吗？"
Talkplus(2610);--52, "小兄弟，难道你对我这“珍珑”也有兴趣？"
Talkplus(2611);--0, "“珍珑”？哦，是不是类似那种摆在公园，要人来破解这盘棋的生意。若能解开的话，就有一些奖品。"
Talkplus(2612);--52, "小兄弟说些什么，老朽不太清楚，不过这“珍珑”是有点像你所说的意味。"
Talkplus(2613);--0, "这盘局很难解吗？"
Talkplus(2614);--52, "这个珍珑棋局乃先师所设。先师当年穷三年之心血，这才布成，深盼当世棋道中的知心之士，予以破解。老朽三十年来苦加钻研，皆未能参解得透。精通禅理之人，自知禅宗要旨，在于“顿悟”。穷年累月的苦功，未必能及具有宿根慧心之人的一见即悟。棋道也是一般，才气横溢的八九岁小儿，棋枰上往往能胜一流高手。"
Talkplus(2615);--52, "虽然老朽参研不透，但天下才士甚众，未必都破解不得。先师当年留下了这个心愿，倘若有人破解开了，完了先师这个心愿，先师虽已不在人世，泉下有知，也必大感欣慰。"
Talkplus(2616);--0, "可惜晚辈棋力不佳，否则我倒也想试一试。"
Talkplus(2617);--52, "这棋原是极难，棋力不弱之人，若解不开甚至有可能走火入魔。公子就别勉强自己了。"
ModifyEvent(-2, -2, -2, -2, 534, -1, -1, -2, -2, -2, -2, -2, -2);
SetFlag("ShowLocationName.擂鼓山",1);--大地图显示当前地图名
do return end;