Talkplus(2371);--0, "请问这位师父，这里就是少林寺吗？"
Talkplus(2372);--96, "正是。"
Talkplus(2373);--0, "少林寺耶！武学的殿堂，武侠小说中绝对少不了的场景，赶紧进去看一看。"
Talkplus(2374);--96, "方丈率寺中弟子，与其余五大派共同围攻光明顶去了，至今未回。请施主下山。"
ModifyEvent(-2, 3, -2, -2, 521, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu启动脚本521，场景28-3
ModifyEvent(-2, 4, -2, -2, 521, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu启动脚本521，场景28-4
ModifyEvent(-2, 5, -2, -2, 521, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu启动脚本521，场景28-5
ModifyEvent(-2, 6, -2, -2, 521, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu启动脚本521，场景28-6
SetFlag("ShowLocationName.少林寺",1);--大地图显示当前地图名
do return end;