Talkplus(525);--17,"你是谁？怎么进来的？金花婆婆呢？"
Talkplus(526);--0,"在下只是路过此岛，不小心跟那老太婆打一架。打赢后，那老太婆好像以为我是来救人的，所以就……不知前辈为何在此？"
Talkplus(527);--17,"我叫王难姑，是蝶谷医仙胡青牛的妻子。那老太婆则是这灵蛇岛的岛主金花婆婆。多年以前，我先生因为一些缘故，没有医治一位银叶先生，后来听说他病逝了。"
Talkplus(528);--17,"其实，这位银叶先生就是金花婆婆的丈夫。几天前，这个金花婆婆为了报仇，来到我蝴蝶谷中，打伤我丈夫，并把我掳到这岛上，说要让我夫妇俩也尝尝生离死别的痛苦。"
Talkplus(529);--0,"原来是这么一回事。好了，现在没事了，前辈可以回蝴蝶谷了。"
Talkplus(530);--17,"谢谢少侠相助，我夫妇俩不会忘记少侠的恩情。"
Talkplus(531);--0,"哪里，哪里，路见不平，拔刀相助，本是我辈中人该做的事。"
Talkplus(532);--17,"好，那我先回蝴蝶谷了，待少侠有空时，一定要到我蝴蝶谷中作客。对了，我蝴蝶谷极为隐密，一般人不易找到，它的座标是在（２３８，２１９）。你一定要来哦！我和外子一定要送你些东西来报答你。"
Talkplus(533);--0,"前辈慢走。"
ModifyEvent(-2, -2, 0, 0, -1, -1, -1, -1, -1, -1, -2, -2, -2); --移除王难姑
jyx2_ReplaceSceneObject("", "NPC/王难姑", ""); 
if jyx2_CheckEventCount(17,333,0) == 0 then Add3EventNum(17,333,Calendar(2),0,0) end;--初识王难姑计数器
ModifyEvent(44, 1, 1, 1, 123, -1, -1, 5290, 5290, 5290, -2, -2, -2); --在蝴蝶谷将王难姑设置为显示
jyx2_ReplaceSceneObject("44", "NPC/王难姑", "1"); 
ModifyEvent(44, 0, -2, -2, 95, -1, -1, -2, -2, -2, -2, -2, -2);
DarkScence();
LightScence();
AddEthics(2);
do return end;