txt = {};
txt[1] = {4437,4362,4363,4364};--胡斐
txt[2] = {4438,4365,4366,4367};--程灵素
txt[3] = {4439,4368,4369,4370};--张无忌
txt[4] = {4440,4371,4372,4373};--胡青牛
txt[5] = {4441,4374,4375,4376};--王难姑
txt[6] = {4442,4377,4378,4379};--蓝凤凰
txt[7] = {4443,4380,4381,4382};--平一指
txt[8] = {4444,4383,4384,4385};--田伯光
txt[9] = {4445,4386,4387,4388};--令狐冲
txt[10] = {4446,4389,4390,4391};--林平之
txt[11] = {4447,4392,4393,4394};--狄云
txt[12] = {4448,4395,4396,4397};--石破天
txt[13] = {4449,4398,4399,4400};--岳老三
txt[14] = {4450,4401,4402,4403};--薛慕华
txt[15] = {4451,4404,4405,4406};--阿紫
txt[16] = {4452,4407,4408,4409};--游坦之
txt[17] = {4453,4410,4411,4412};--虚竹
txt[18] = {4454,4413,4414,4415};--慕容复
txt[19] = {4455,4416,4417,4418};--段誉
txt[20] = {4456,4419,4420,4421};--袁承志
txt[21] = {4457,4422,4423,4424};--杨过
txt[22] = {4458,4425,4426,4427};--小龙女
txt[23] = {4459,4428,4429,4430};--欧阳克
txt[24] = {4460,4431,4432,4433};--程英
txt[25] = {4461,4434,4435,4436};--王语嫣
for i = 1, #txt do
	battlenum = i + 254;--战斗编号（=触发器编号）
	talkid = txt[i][1];
	talktxt1 = txt[i][2];
	talktxt2 = txt[i][3];
	talktxt3 = txt[i][4];
	-- if (talkid == 76) then
	-- talkid = talkid + 33;--王语嫣修正
	-- end;
	if (tonumber(GetCurrentEventID()) == battlenum) then
		Talkplus(talktxt1);
		Talkplus(talkid);
		if TryBattle(battlenum) == false then goto label0 end;
		LightScence();
		RestTeam();
		Talkplus(talktxt2);
		do return end;
		::label0::
		LightScence();
		RestTeam();
		Talkplus(talktxt3);
		do return end;
	end;
end;
do return end;