Talkplus(1900);--66, "小子，事情办好了吗？"
Talkplus(1901);--0, "晚辈已见过了段皇爷。"
Talkplus(1902);--66, "你杀了他了？"
Talkplus(1903);--0, "没有。"
Talkplus(1904);--66, "哼！连这事都办不好，我原本还指望你上桃花岛帮我救周伯通呢。"
Talkplus(1905);--0, "救周伯通？他早己不在桃花岛了，听说他逃了出来。"
Talkplus(1906);--66, "真的？"
Talkplus(1907);--0, "晚辈觉得前辈还是不要报这个仇，何况你儿子也不是段皇爷所杀的。"
Talkplus(1908);--66, "虽非他所杀，但也是被他害死的。"
Talkplus(1909);--0, "段皇爷不肯救你儿子，也是因为爱你啊。"
Talkplus(1910);--66, "哼，爱我？"
Talkplus(1911);--0, "他是喝周前辈的醋。若是不爱你，他为什么要喝醋？他见到你那块“四张机”的鸳鸯锦帕，实是伤心至极。依我看这件事还是算了吧。"
Talkplus(1912);--66, "……那好，只要你把周伯通找来见我，我就告诉你《射雕英雄传》一书的下落。"
Talkplus(1913);--0, "这个简单，只要不叫我去杀好人都可以。"
ModifyEvent(-2, -2, -2, -2, 421, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动421脚本。场景21-编号01
ModifyEvent(20, 4, -2, -2, 411, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动411脚本。场景20-编号04
ModifyEvent(47, 0, -2, -2, 428, -1, -1, -2, -2, -2, -2, -2, -2);--by fanyu|启动428脚本。场景47-编号00
ChangeMMapMusic(3);
do return end;