Talkplus(2246);--0, "古人说，上有天堂，下有苏杭，西湖的景色果然怡人，慕容公子住在这地方，又有美人相陪，真是好福气呀。"
Talkplus(2247);--51, "阁下是谁，到这燕子坞来所为何事？"
Talkplus(2248);--0, "在下之名不足挂齿，流浪江湖只为回到未来，今日特来请慕容公子指点迷津。"
Talkplus(2249);--51, "阁下有话就直说吧。"
Talkplus(2250);--0, "江湖中盛传，姑苏慕容家中藏书丰富，天下武林奇书尽皆收录……"
Talkplus(2251);--51, "原来是想看我慕容家丰富的武功秘笈……"
Talkplus(2252);--0, "慕容公子误会了，在下要找的，不是什么武功秘笈，只是几本小说而已。"
Talkplus(2253);--51, "你是说……"
Talkplus(2254);--0, "世人皆以为“十四天书”是什么高深的武功秘笈，其实据我所知不过是几本小说罢了。不知慕容家是否有收藏这些书籍？"
Talkplus(2255);--51, "对不起，燕子坞的藏书并没有阁下想要的。"
Talkplus(2256);--0, "哦！是这样子啊……"
Talkplus(2257);--51, "不过……"
Talkplus(2258);--0, "不过什么……"
Talkplus(2259);--51, "不过其中一本书的下落，我是知道的……"
Talkplus(2260);--0, "哪一本书？"
Talkplus(2261);--51, "《天龙八部》。"
Talkplus(2262);--0, "真的？在哪里？"
Talkplus(2263);--51, "不知阁下可曾听过我慕容家的绝技。"
Talkplus(2264);--0, "嗯，江湖中人提过，姑苏慕容“以彼之道，还施彼身”。"
Talkplus(2265);--51, "是啊，既然这样，你知道应该怎么做了。"
Talkplus(2266);--0, "你是说……"
Talkplus(2267);--51, "如果你帮我找到一些东西，我就告诉你《天龙八部》的下落。"
Talkplus(2268);--0, "吓死我了，我以为你要用我擅长的武功来对付我……要知道，我所会的武功很多……恐怕你不是这么容易“以彼之道，还施彼身”。"
Talkplus(2269);--51, "阁下见笑了。"
Talkplus(2270);--0, "不知公子要找什么东西？"
Talkplus(2271);--51, "大燕国的传国玉玺。"
Talkplus(2272);--0, "大燕国的传国玉玺？慕容公子是古董收藏家吗？干嘛要“大燕国”的玉玺？你又不是皇帝，要玉玺做啥用！"
Talkplus(2273);--51, "住口，我乃大燕慕容王孙。"
Talkplus(2274);--0, "失敬，失敬。"
Talkplus(2275);--109, "表哥，你怎么还在想复国的事情。"
Talkplus(2276);--51, "历代祖宗遗训，怎可忘记。"
Talkplus(2277);--0, "这位姑娘，有如天仙，不知芳名……"
Talkplus(2278);--51, "这是我表妹王语嫣。她熟读各派武功精华，虽本身不会任何武功，但武学见识广。"
Talkplus(2279);--0, "王姑娘，你好……"
ModifyEvent(-2, 2, -2, -2, -2, -2, -2, 6298, -2, -2, -2, -2, -2); --记录改变贴图，Ka941 JudgeScenePic
SetFlag("ShowLocationName.燕子坞",1);--大地图显示当前地图名
if jyx2_CheckEventCount(51,333,0) == 0 then Add3EventNum(51,333,Calendar(2),0,0) end;--初识慕容复计数器
if jyx2_CheckEventCount(76,333,0) == 0 then Add3EventNum(76,333,Calendar(2),0,0) end;--初识王语嫣计数器
if InTeam(53) == true then goto label0 end;
Talkplus(2280);--51, "记得，你若想知道《天龙八部》的下落，就快去找大燕国的传国玉玺。"
ModifyEvent(-2, -2, -2, -2, 489, 493, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 2, -2, -2, 490, -1, -1, -2, -2, -2, -2, -2, -2);
do return end;
::label0::
jyx2_ReplaceSceneObject("", "NPC/段誉", "1");--段誉
Talkplus(2281);--53, "神仙姊姊……神仙姊姊……小生段誉想你想得好苦啊！"
Talkplus(2282);--109, "这…………"
Talkplus(2283);--51, "你这呆子干什么，这样看着我表妹。"
Talkplus(2284);--0, "慕容公子请息怒，我这段兄弟是认错人了，只是……只是真的很像……"
Talkplus(2285);--51, "像什么？"
Talkplus(2286);--0, "没有，我是说令表妹很像一个人，一个我们在无量山中发现的玉像，实在太像了。"
Talkplus(2287);--53, "神仙姊姊……你怎么不跟我说话……你跟我们走好不好。"
Talkplus(2288);--109, "不行，我要跟着我表哥。"
Talkplus(2289);--0, "段兄，别无礼了。慕容公子，我们告退了。"
Talkplus(2290);--51, "记得，你若想知道《天龙八部》的下落，就快去找大燕国的传国玉玺。"
jyx2_ReplaceSceneObject("", "NPC/段誉", "");--段誉
ModifyEvent(-2, -2, -2, -2, 489, 493, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 2, -2, -2, 490, -1, -1, -2, -2, -2, -2, -2, -2);
ModifyEvent(-2, 0, -2, -2, -1, -1, 491, -1, -1, -1, -2, -2, -2);
do return end;