txt = {};
txt[1] = {4548,4473,4474,4475};--主角
txt[2] = {4549,4476,4477,4478};--程灵素
txt[3] = {4550,4479,4480,4481};--张无忌
txt[4] = {4551,4482,4483,4484};--胡青牛
txt[5] = {4552,4485,4486,4487};--王难姑
txt[6] = {4553,4488,4489,4490};--蓝凤凰
txt[7] = {4554,4491,4492,4493};--平一指
txt[8] = {4555,4494,4495,4496};--田伯光
txt[9] = {4556,4497,4498,4499};--令狐冲
txt[10] = {4557,4500,4501,4502};--林平之
txt[11] = {4558,4503,4504,4505};--狄云
txt[12] = {4559,4506,4507,4508};--石破天
txt[13] = {4560,4509,4510,4511};--岳老三
txt[14] = {4561,4512,4513,4514};--薛慕华
txt[15] = {4562,4515,4516,4517};--阿紫
txt[16] = {4563,4518,4519,4520};--游坦之
txt[17] = {4564,4521,4522,4523};--虚竹
txt[18] = {4565,4524,4525,4526};--慕容复
txt[19] = {4566,4527,4528,4529};--段誉
txt[20] = {4567,4530,4531,4532};--袁承志
txt[21] = {4568,4533,4534,4535};--杨过
txt[22] = {4569,4536,4537,4538};--小龙女
txt[23] = {4570,4539,4540,4541};--欧阳克
txt[24] = {4571,4542,4543,4544};--程英
txt[25] = {4572,4545,4546,4547};--王语嫣
for i = 1, #txt do
	battlenum = i + 279;--战斗编号（=触发器编号）
	talkid = txt[i][1];
	talktxt1 = txt[i][2];
	talktxt2 = txt[i][3];
	talktxt3 = txt[i][4];
	-- if (talkid == 76) then
	-- talkid = talkid + 33;--王语嫣修正
	-- end;
	if (GetCurrentEventID() == battlenum) then
		Talkplus(talktxt1);
		Talkplus(talkid);
		if TryBattle(battlenum) == false then goto label0 end;
		LightScence();
		RestTeam();
		Talkplus(talktxt2);
		do return end;
		::label0::
		LightScence();
		RestTeam();
		Talkplus(talktxt3);
		do return end;
	end;
end;
do return end;